## Pandas cont.

In [ ]:
## Objective of the day

# How to select multiple columns with log and ilog
# How to apply some function to df columsn 
# how to merge, concatanate df.

In [3]:
import pandas as pd
import numpy as np

In [5]:
df_listing = pd.read_csv('listings.csv')

FileNotFoundError: [Errno 2] No such file or directory: 'listings.csv'

In [ ]:
df_listing.to_csv('df_listing_final_07172024.csv')
# Go to folder and you will see the df final in it. 
# Specify the identity of the file as csv or whatever else it is.

In [ ]:
# After data was exported it opens up in excel and to delete the index then 
df_listing.to_csv('df_listing_final_07172024.csv', index = False)

## How to select multiple rows and colums in pandas dataframes?

In [17]:
# row 0, all columns 
df_listing.loc[0, :]

NameError: name 'df_listing' is not defined

In [ ]:
# above you are supposed to get the id frame, the columns and the datas.

In [ ]:
#function loc and iloc

### The loc method is used to select rows and columns by label. 

### A single label, a list of labels, a slice of labels, a boolean series, and a colon ( represents everything like in list slicing).

In [1]:
# row 0,2,4 all columns
df_listing.loc[[0,2,4],:]
# for rows and columns it does not read it like a step when written like this.

NameError: name 'df_listing' is not defined

In [ ]:
# Rows 0 through 2 (inclusive), all columns
df_listing.loc[0:2, :]

In [ ]:
# Interesting in just getting the host_name column and the rows 0 to 2.
df_listing.loc[0:2, 'host_name']

In [ ]:
#rows 0 through 2(inclusive), column host_name and host_id

df_listing.loc[0:2, ['host_id', 'host_name']]

In [ ]:
# So above we learn that for the rows and columsn we can just use commas to say which ones we want 
# for start through stop we use the column like in list slicing 
# for more things that you want to add for columns you can make another list.

In [ ]:
df_listing[0:3][['host_id', 'host_name']]
#when slicing dataframe directly it is exclusive

In [ ]:
df_listing[['host_id', 'host_name']].head(3)
# Another way of doing that which is above us.

In [ ]:
# rows 0 through 2 (inclusive), columnhost_id through Price(inclusive) 
df_listing.loc[0:2, 'host_id':'price']]
# for the columns you have to specifically call the columns name while the rows is by the index.

In [ ]:
# all rows which the host name is Karen and room_type
df_listing[df_listing['host_name'] == 'Karen']['room_type']

In [ ]:
# In this case he is going to use the loc function 
df_listing.loc[df_listing['hot_name'] == 'Karen','room_type']
# if you have millions of data the loc works more efficiently...

## Iloc

### I stands for the integer position: select rows and columns by integer position. You can do 
### a single integer position, a list of intege position, a slice of integer position and a colon (indicates all integer positions).

In [ ]:
# rows in postions 2 and 4, columns in position 2 and 4
df_listing.iloc[[2, 4]: [2, 4]]

In [ ]:
# gives host_id and neighborhood_group with the indexes

In [ ]:
df_listing.info()
# helps with identification of column integers

In [ ]:
# row in position 0 through 2 (exclusive) and columsn in position 0 through 5(exclusive)

df_listing.iloc[0:2, 0:5]

## Apply Function

In [ ]:
http://bit.ly/kaggletrain

In [22]:
df_titanic = pd.read_csv('http://bit.ly/kaggletrain')

In [24]:
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
# Craeting mapping 
df_titanic["Embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [28]:
# we want s to map to 0, c to map to 1, and q to map to 2. 
# we are going to use the MAP Method 



# Step 1. Create a new column 
# Step 2. equal that to old columns 
# step 3. use .map and create a dictionary inside of it. 
df_titanic['Embarked_Num']= df_titanic['Embarked'].map({'S':0, 
                                                        'C' : 1,
                                                        'Q' : 2})

In [32]:
df_titanic.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Embarked_Num
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0.0
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,2.0
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,0.0
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,0.0
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S,0.0
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,1.0

In [ ]:
## Goal: Apply a function to each element in a Series
# Method : apply 
#Note: map method can be substituted for apply in many cases, but apply is more flexible and 
# so it is recommended

In [ ]:
#apply the "max" fucntion along wiwth axis = 0 (rows)to calculate the maximum of each column

In [36]:
df_titanic.loc[:, ["Pclass", "Fare"]].apply(max, axis = 0)

Pclass      3.0000
Fare      512.3292
dtype: float64

In [ ]:
# Choose what you want first using the loc or iloc function then use .apply and mathematics according to axis = 0 or axis = 1...

In [ ]:
#applymap (dataframe method)

In [40]:
df_titanic.loc[:, ["Pclass", "Fare"]].applymap(int).head()

C:\Users\draco\AppData\Local\Temp\ipykernel_15364\2707429170.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_titanic.loc[:, ["Pclass", "Fare"]].applymap(int).head()

   Pclass  Fare
0       3     7
1       1    71
2       3     7
3       1    53
4       3     8

## DataFrame Merge/Join/Append

In [ ]:
# Types of Merging 
# Left joining : Bend diagrams (A and B) and you want to join them. Includes everything in A and that which it has in common with B. 
# Right joining : Bend Diagram ( A and B ) and you want to join them. Includes everyting in B and that which it has in common with A. 
# Outer Join : EVerything is included
# Inner join : Only the similarities are included. 
# in order to join distincts dataframes you need the same id on both; if the names for the same id are different take sample from dataframe ( check and see what 
#b are the right join keys)

In [45]:
df1 = pd.DataFrame({'color': ['green', 'yeloow', 'red'],
                    'num' : [1,2,3]})
df2 = pd.DataFrame({'color': ['green', 'yeloow', 'pink'],
                    'size' : ["S","M","L"]})

In [47]:
df1

    color  num
0   green    1
1  yeloow    2
2     red    3

In [49]:
df2

    color size
0   green    S
1  yeloow    M
2    pink    L

In [ ]:
# Inner Join

In [53]:
pd.merge(df1, 
         df2, 
         how = 'inner',
         on = 'color' )

    color  num size
0   green    1    S
1  yeloow    2    M

In [ ]:
# above it ask how to join which is the different of joins that there are 
# and also the on which equal the same or have the same thing

In [57]:
# Left join - Include all observations found in DF1 and bring the other columns from DF2 
pd.merge(df1, 
         df2, 
         how = 'left',
         on = 'color')

    color  num size
0   green    1    S
1  yeloow    2    M
2     red    3  NaN

In [ ]:
# Above in the table you can see they have red in DF1 but not in DF2.

In [59]:
# Right join - Include everything in DF2 and bring the other columsn of DF1
pd.merge(df1, 
         df2, 
         how = 'right',
         on = 'color')

    color  num size
0   green  1.0    S
1  yeloow  2.0    M
2    pink  NaN    L

In [61]:
#Outer join- everything is combined in this one. 
pd.merge(df1, 
         df2, 
         how = 'outer',
         on = 'color')

    color  num size
0   green  1.0    S
1  yeloow  2.0    M
2     red  3.0  NaN
3    pink  NaN    L

In [79]:
 df1 = df1.rename(columns = {'color' : 'clr'})

In [81]:
df1

      clr  num
0   green    1
1  yeloow    2
2     red    3

In [85]:
pd.merge(df1, 
         df2, 
         how = 'left',
         left_on = 'clr',
         right_on = 'color')
# specifically say what is being merge.

      clr  num   color size
0   green    1   green    S
1  yeloow    2  yeloow    M
2     red    3     NaN  NaN

In [ ]:
# Concat, append, join ( they do similar things) ( Homework)